{"resourceType":"ValueSet","id":"v3-EntityDeterminer","meta":{"lastUpdated":"2015-07-31T00:00:00.000+10:00","profile":["http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"]},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.1.11.10878"}],"url":"http://hl7.org/fhir/ValueSet/v3-EntityDeterminer","version":"2015-07-31","name":"v3 Code System EntityDeterminer","status":"active","experimental":false,"publisher":"HL7, Inc","contact":[{"telecom":[{"system":"other","value":"http://hl7.org"}]}],"date":"2015-07-31","description":" EntityDeterminer in natural language grammar is the class of words that comprises articles, demonstrative pronouns, and quantifiers. In the RIM, determiner is a structural code in the Entity class to distinguish whether any given Entity object stands for some, any one, or a specific thing.","codeSystem":{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.5.30"}],"system":"http://hl7.org/fhir/v3/EntityDeterminer","caseSensitive":true,"concept":[{"code":"INSTANCE","abstract":false,"display":"specific","definition":"Description:A determiner that specifies that the Entity object represents a particular physical thing (as opposed to a universal, kind, or class of physical thing).                                                      Discussion: It does not matter whether an INSTANCE still exists as a whole at the point in time (or process) when we mention it, for example, a drug product lot is an INSTANCE even though it has been portioned out for retail purpose.","concept":[{"code":"GROUP","abstract":false,"display":"specific group","definition":"A determiner that specifies that the Entity object represents a particular collection of physical things (as opposed to a universal, kind, or class of physical thing).  While the collection may resolve to having only a single individual (or even no individuals), the potential should exist for it to cover multiple individuals."}]},{"code":"KIND","abstract":false,"display":"described","definition":"Description:A determiner that specifies that the Entity object represents a universal, kind or class of physical thing (as opposed to a particular thing).","concept":[{"code":"GROUPKIND","abstract":false,"display":"described group","definition":"A determiner that specifies that the Entity object represents a universal, kind or class of collections physical things.  While the collection may resolve to having only a single individual (or even no individuals), the potential should exist for it to cover multiple individuals."},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-deprecated","valueBoolean":true}],"code":"QUANTIFIED_KIND","abstract":false,"display":"described quantified","definition":"The described quantified determiner indicates that the given Entity is taken as a general description of a specific amount of a thing. For example, QUANTIFIED_KIND of syringe (quantity \u003d 3,) stands for exactly three syringes."}]}]}}