{"resourceType":"ValueSet","id":"v3-DocumentCompletion","meta":{"lastUpdated":"2015-07-31T00:00:00.000+10:00","profile":["http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"]},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.1.11.271"}],"url":"http://hl7.org/fhir/ValueSet/v3-DocumentCompletion","version":"2015-07-31","name":"v3 Code System DocumentCompletion","status":"active","experimental":false,"publisher":"HL7, Inc","contact":[{"telecom":[{"system":"other","value":"http://hl7.org"}]}],"date":"2015-07-31","description":" Identifies the current completion state of a clinical document.","codeSystem":{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.5.33"}],"system":"http://hl7.org/fhir/v3/DocumentCompletion","caseSensitive":true,"concept":[{"code":"AU","abstract":false,"display":"authenticated","definition":"A completion status in which a document has been signed manually or electronically by one or more individuals who attest to its accuracy.  No explicit determination is made that the assigned individual has performed the authentication.  While the standard allows multiple instances of authentication, it would be typical to have a single instance of authentication, usually by the assigned individual."},{"code":"DI","abstract":false,"display":"dictated","definition":"A completion status in which information has been orally recorded but not yet transcribed."},{"code":"DO","abstract":false,"display":"documented","definition":"A completion status in which document content, other than dictation, has been received but has not been translated into the final electronic format.  Examples include paper documents, whether hand-written or typewritten, and intermediate electronic forms, such as voice to text."},{"code":"IN","abstract":false,"display":"incomplete","definition":"A completion status in which information is known to be missing from a transcribed document."},{"code":"IP","abstract":false,"display":"in progress","definition":"A workflow status where the material has been assigned to personnel to perform the task of transcription. The document remains in this state until the document is transcribed."},{"code":"LA","abstract":false,"display":"legally authenticated","definition":"A completion status in which a document has been signed manually or electronically by the individual who is legally responsible for that document. This is the most mature state in the workflow progression."},{"code":"NU","abstract":false,"display":"nullified document","definition":"A completion status in which a document was created in error or was placed in the wrong chart. The document is no longer available."},{"code":"PA","abstract":false,"display":"pre-authenticated","definition":"A completion status in which a document is transcribed but not authenticated."},{"code":"UC","abstract":false,"display":"unsigned completed document","definition":"A completion status where the document is complete and there is no expectation that the document will be signed."}]}}