{"resourceType":"ValueSet","id":"v3-DataOperation","meta":{"lastUpdated":"2015-07-31T00:00:00.000+10:00","profile":["http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"]},"url":"http://hl7.org/fhir/ValueSet/v3-DataOperation","version":"2015-07-31","name":"v3 Code System DataOperation","status":"active","experimental":false,"publisher":"HL7, Inc","contact":[{"telecom":[{"system":"other","value":"http://hl7.org"}]}],"date":"2015-07-31","description":"**** MISSING DEFINITIONS ****","codeSystem":{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.5.1123"}],"system":"http://hl7.org/fhir/v3/DataOperation","caseSensitive":true,"concept":[{"code":"OPERATE","abstract":false,"display":"operate","definition":"Description:Act on an object or objects.","concept":[{"code":"CREATE","abstract":false,"display":"create","definition":"Description:Fundamental operation in an Information System (IS) that results only in the act of bringing an object into existence. Note: The preceding definition is taken from the HL7 RBAC specification.  There is no restriction on how the operation is invoked, e.g. via a user interface. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"DELETE","abstract":false,"display":"delete","definition":"Description:Fundamental operation in an Information System (IS) that results only in the removal of information about an object from memory or storage. Note: The preceding definition is taken from the HL7 RBAC specification.  There is no restriction on how the operation is invoked, e.g. via a user interface."},{"code":"EXECUTE","abstract":false,"display":"execute","definition":"Description:Fundamental operation in an IS that results only in initiating performance of a single or set of programs (i.e., software objects). Note: The preceding definition is taken from the HL7 RBAC specification.  There is no restriction on how the operation is invoked, e.g. via a user interface."},{"code":"READ","abstract":false,"display":"read","definition":"Description:Fundamental operation in an Information System (IS) that results only in the flow of information about an object to a subject. Note: The preceding definition is taken from the HL7 RBAC specification.  There is no restriction on how the operation is invoked, e.g. via a user interface."},{"code":"UPDATE","abstract":false,"display":"revise","definition":"Definition:Fundamental operation in an Information System (IS) that results only in the revision or alteration of an object. Note: The preceding definition is taken from the HL7 RBAC specification. There is no restriction on how the operation is invoked, e.g. via a user interface.","concept":[{"code":"APPEND","abstract":false,"display":"append","definition":"Description:Fundamental operation in an Information System (IS) that results only in the addition of information to an object already in existence. Note: The preceding definition is taken from the HL7 RBAC specification.  There is no restriction on how the operation is invoked, e.g. via a user interface."},{"code":"MODIFYSTATUS","abstract":false,"display":"modify status","definition":"Description:Change the status of an object representing an Act.","concept":[{"code":"ABORT","abstract":false,"display":"abort","definition":"Description:Change the status of an object representing an Act to \"aborted\", i.e., terminated prior to the originally intended completion. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"ACTIVATE","abstract":false,"display":"activate","definition":"Description:Change the status of an object representing an Act to \"active\", i.e., so it can be performed or is being performed, for the first time. (Contrast with REACTIVATE.) For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"CANCEL","abstract":false,"display":"cancel","definition":"Description:Change the status of an object representing an Act to \"cancelled\", i.e., abandoned before activation. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"COMPLETE","abstract":false,"display":"complete","definition":"Description:Change the status of an object representing an Act to \"completed\", i.e., terminated normally after all of its constituents have been performed. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"HOLD","abstract":false,"display":"hold","definition":"Description:Change the status of an object representing an Act to \"held\", i.e., put aside an Act that is still in preparatory stages.  No action can occur until the Act is released. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"JUMP","abstract":false,"display":"jump","definition":"Description:Change the status of an object representing an Act to a normal state. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"NULLIFY","abstract":false,"display":"nullify","definition":"Description:Change the status of an object representing an Act to \"nullified\", i.e., treat as though it never existed. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"OBSOLETE","abstract":false,"display":"obsolete","definition":"Description:Change the status of an object representing an Act to \"obsolete\" when it has been replaced by a new instance. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"REACTIVATE","abstract":false,"display":"reactivate","definition":"Description:Change the status of a formerly active object representing an Act to \"active\", i.e., so it can again be performed or is being performed. (Contrast with ACTIVATE.) For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"RELEASE","abstract":false,"display":"release","definition":"Description:Change the status of an object representing an Act so it is no longer \"held\", i.e., allow action to occur. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"RESUME","abstract":false,"display":"resume","definition":"Description:Change the status of a suspended object representing an Act to \"active\", i.e., so it can be performed or is being performed. For an HL7 Act, the state transitions per the HL7 Reference Information Model."},{"code":"SUSPEND","abstract":false,"display":"suspend","definition":"Definition:Change the status of an object representing an Act to suspended, i.e., so it is temporarily not in service."}]}]}]}]}}