{"resourceType":"ValueSet","id":"v3-HtmlLinkType","meta":{"lastUpdated":"2015-07-31T00:00:00.000+10:00","profile":["http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"]},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.1.11.11017"}],"url":"http://hl7.org/fhir/ValueSet/v3-HtmlLinkType","version":"2015-07-31","name":"v3 Code System HtmlLinkType","status":"active","experimental":false,"publisher":"HL7, Inc","contact":[{"telecom":[{"system":"other","value":"http://hl7.org"}]}],"date":"2015-07-31","description":" HtmlLinkType values are drawn from HTML 4.0 and describe the relationship between the current document and the anchor that is the target of the link","codeSystem":{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.5.58"}],"system":"http://hl7.org/fhir/v3/HtmlLinkType","caseSensitive":true,"concept":[{"code":"alternate","abstract":false,"display":"alternate","definition":"Designates substitute versions for the document in which the link occurs. When used together with the lang attribute, it implies a translated version of the document. When used together with the media attribute, it implies a version designed for a different medium (or media)."},{"code":"appendix","abstract":false,"display":"appendix","definition":"Refers to a document serving as an appendix in a collection of documents."},{"code":"bookmark","abstract":false,"display":"bookmark","definition":"Refers to a bookmark. A bookmark is a link to a key entry point within an extended document. The title attribute may be used, for example, to label the bookmark. Note that several bookmarks may be defined in each document."},{"code":"chapter","abstract":false,"display":"chapter","definition":"Refers to a document serving as a chapter in a collection of documents."},{"code":"contents","abstract":false,"display":"contents","definition":"Refers to a document serving as a table of contents. Some user agents also support the synonym ToC (from \"Table of Contents\")."},{"code":"copyright","abstract":false,"display":"copyright","definition":"Refers to a copyright statement for the current document."},{"code":"glossary","abstract":false,"display":"glossary","definition":"Refers to a document providing a glossary of terms that pertain to the current document."},{"code":"help","abstract":false,"display":"help","definition":"Refers to a document offering help (more information, links to other sources of information, etc.)."},{"code":"index","abstract":false,"display":"index","definition":"Refers to a document providing an index for the current document."},{"code":"next","abstract":false,"display":"next","definition":"Refers to the next document in a linear sequence of documents. User agents may choose to preload the \"next\" document, to reduce the perceived load time."},{"code":"prev","abstract":false,"display":"prev","definition":"Refers to the previous document in an ordered series of documents. Some user agents also support the synonym \"Previous\"."},{"code":"section","abstract":false,"display":"section","definition":"Refers to a document serving as a section in a collection of documents."},{"code":"start","abstract":false,"display":"start","definition":"Refers to the first document in a collection of documents. This link type tells search engines which document is considered by the author to be the starting point of the collection."},{"code":"stylesheet","abstract":false,"display":"stylesheet","definition":"Refers to an external style sheet. See the section on external style sheets for details. This is used together with the link type \"Alternate\" for user-selectable alternate style sheets."},{"code":"subsection","abstract":false,"display":"subsection","definition":"Refers to a document serving as a subsection in a collection of documents."}]}}