{"resourceType":"ValueSet","id":"v3-AddressPartType","meta":{"lastUpdated":"2015-07-31T00:00:00.000+10:00","profile":["http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"]},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.1.11.10642"}],"url":"http://hl7.org/fhir/ValueSet/v3-AddressPartType","version":"2015-07-31","name":"v3 Code System AddressPartType","status":"active","experimental":false,"publisher":"HL7, Inc","contact":[{"telecom":[{"system":"other","value":"http://hl7.org"}]}],"date":"2015-07-31","description":"  Description: Code that specifies whether an address part names the street, city, country, postal code, post box, etc. Discussion: The hierarchical nature of these concepts shows composition; e.g. \"Street Name\" is part of \"Street Address Line\"","codeSystem":{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.5.16"}],"system":"http://hl7.org/fhir/v3/AddressPartType","caseSensitive":true,"concept":[{"code":"ADL","abstract":false,"display":"additional locator","definition":"This can be a unit designator, such as apartment number, suite number, or floor. There may be several unit designators in an address (e.g. \"3rd floor, Appt. 342\"). This can also be a designator pointing away from the location, rather than specifying a smaller location within some larger one (e.g. Dutch \"t.o.\" means \"opposite to\" for house boats located across the street facing houses)."},{"code":"AL","abstract":false,"display":"address line","definition":"Description: An address line is for either an additional locator, a delivery address or a street address.","concept":[{"code":"DAL","abstract":false,"display":"delivery address line","definition":"A delivery address line is frequently used instead of breaking out delivery mode, delivery installation, etc.  An address generally has only a delivery address line or a street address line, but not both."},{"code":"SAL","abstract":false,"display":"street address line","definition":"Description: A street address line is frequently used instead of breaking out build number, street name, street type, etc. An address generally has only a delivery address line or a street address line, but not both."}]},{"code":"BNN","abstract":false,"display":"building number numeric","definition":"The numeric portion of a building number"},{"code":"BNR","abstract":false,"display":"building number","definition":"The number of a building, house or lot alongside the street.  Also known as \"primary street number\".  This does not number the street but rather the building."},{"code":"BNS","abstract":false,"display":"building number suffix","definition":"Any alphabetic character, fraction or other text that may appear after the numeric portion of a building number"},{"code":"CAR","abstract":false,"display":"care of","definition":"The name of the party who will take receipt at the specified address, and will take on responsibility for ensuring delivery to the target recipient"},{"code":"CEN","abstract":false,"display":"census tract","definition":"A geographic sub-unit delineated for demographic purposes."},{"code":"CNT","abstract":false,"display":"country","definition":"Country"},{"code":"CPA","abstract":false,"display":"county or parish","definition":"A sub-unit of a state or province. (49 of the United States of America use the term \"county;\" Louisiana uses the term \"parish\".)"},{"code":"CTY","abstract":false,"display":"municipality","definition":"The name of the city, town, village, or other community or delivery center"},{"code":"DEL","abstract":false,"display":"delimiter","definition":"Delimiters are printed without framing white space.  If no value component is provided, the delimiter appears as a line break."},{"code":"DINST","abstract":false,"display":"delivery installation type","definition":"Indicates the type of delivery installation (the facility to which the mail will be delivered prior to final shipping via the delivery mode.) Example: post office, letter carrier depot, community mail center, station, etc."},{"code":"DINSTA","abstract":false,"display":"delivery installation area","definition":"The location of the delivery installation, usually a town or city, and is only required if the area is different from the municipality. Area to which mail delivery service is provided from any postal facility or service such as an individual letter carrier, rural route, or postal route."},{"code":"DINSTQ","abstract":false,"display":"delivery installation qualifier","definition":"A number, letter or name identifying a delivery installation; e.g. for Station A, the delivery installation qualifier would be \u0027A\u0027."},{"code":"DIR","abstract":false,"display":"direction","definition":"Direction (e.g. N, S, W, E)"},{"code":"DMOD","abstract":false,"display":"delivery mode","definition":"Indicates the type of service offered, method of delivery.  For example: post office box, rural route, general delivery, etc."},{"code":"DMODID","abstract":false,"display":"delivery mode identifier","definition":"Represents the routing information such as a letter carrier route number.  It is the identifying number of the designator (the box number or rural route number)."},{"code":"DPID","abstract":false,"display":"delivery point identifier","definition":"A value that uniquely identifies the postal address."},{"code":"INT","abstract":false,"display":"intersection","definition":"Description:An intersection denotes that the actual address is located AT or CLOSE TO the intersection OF two or more streets."},{"code":"POB","abstract":false,"display":"post box","definition":"A numbered box located in a post station."},{"code":"PRE","abstract":false,"display":"precinct","definition":"A subsection of a municipality"},{"code":"STA","abstract":false,"display":"state or province","definition":"A sub-unit of a country with limited sovereignty in a federally organized country."},{"code":"STB","abstract":false,"display":"street name base","definition":"The base name of a roadway or artery recognized by a municipality (excluding street type and direction)"},{"code":"STR","abstract":false,"display":"street name","definition":"street name"},{"code":"STTYP","abstract":false,"display":"street type","definition":"The designation given to the street.  (e.g. Street, Avenue, Crescent, etc.)"},{"code":"UNID","abstract":false,"display":"unit identifier","definition":"The number or name of a specific unit contained within a building or complex, as assigned by that building or complex."},{"code":"UNIT","abstract":false,"display":"unit designator","definition":"Indicates the type of specific unit contained within a building or complex; e.g. Appartment, Floor"},{"code":"ZIP","abstract":false,"display":"postal code","definition":"A postal code designating a region defined by the postal service."}]}}